zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_spi.h
/** @defgroup SPI_LL_EC_CRC CRC
  * @{
  */
#define LL_SPI_CRC_4BIT                            (SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_5BIT                            (SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_6BIT                            (SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_7BIT                            (SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_8BIT                            (SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_9BIT                            (SPI_CFG1_CRCSIZE_3)
#define LL_SPI_CRC_10BIT                           (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_11BIT                           (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_12BIT                           (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_13BIT                           (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_14BIT                           (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_15BIT                           (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_16BIT                           (SPI_CFG1_CRCSIZE_3\
                                                    | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_17BIT                           (SPI_CFG1_CRCSIZE_4)
#define LL_SPI_CRC_18BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_19BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_20BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_21BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_22BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_23BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_24BIT                           (SPI_CFG1_CRCSIZE_4\
                                                    | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_25BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3)
#define LL_SPI_CRC_26BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_27BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_28BIT                           (SPI_CFG1_CRCSIZE_4\
                                                    | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_29BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_30BIT                           (SPI_CFG1_CRCSIZE_4\
                                                    | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_31BIT                           (SPI_CFG1_CRCSIZE_4\
                                                    | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_32BIT                           (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3\
                                                    | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_NSS_MODE NSS Mode
  * @{
  */
#define LL_SPI_NSS_SOFT                            (SPI_CFG2_SSM)
#define LL_SPI_NSS_HARD_INPUT                      (0x00000000UL)
#define LL_SPI_NSS_HARD_OUTPUT                     (SPI_CFG2_SSOE)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_RX_FIFO RxFIFO Packing LeVel
  * @{
  */
#define LL_SPI_RX_FIFO_0PACKET               (0x00000000UL)    /* 0 or multiple of 4 packet available is the RxFIFO */
#define LL_SPI_RX_FIFO_1PACKET               (SPI_SR_RXPLVL_0)
#define LL_SPI_RX_FIFO_2PACKET               (SPI_SR_RXPLVL_1)
#define LL_SPI_RX_FIFO_3PACKET               (SPI_SR_RXPLVL_1 | SPI_SR_RXPLVL_0)
/**
  * @}
  */

#if defined(SPI8)
/*!< HW Trigger signal is LPDMA_CH0_TRG     */
#define LL_SPI8_LPDMA_CH0_TCF_TRG          (uint32_t)(0x00000000U)
/*!< HW Trigger signal is LPDMA_CH1_TRG     */
#define LL_SPI8_LPDMA_CH1_TCF_TRG          (uint32_t)(0x1U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPDMA_CH2_TRG     */
#define LL_SPI8_LPDMA_CH2_TCF_TRG          (uint32_t)(0x2U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPDMA_CH3_TRG     */
#define LL_SPI8_LPDMA_CH3_TCF_TRG          (uint32_t)(0x3U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is EXTI4_TRG         */
#define LL_SPI8_EXTI4_TRG                  (uint32_t)(0x4U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is EXTI8_TRG         */
#define LL_SPI8_EXTI5_TRG                  (uint32_t)(0x5U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM3_CH1_TRG    */
#define LL_SPI8_LPTIM3_CH1_TRG             (uint32_t)(0x7U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM4_CH1_TRG    */
#define LL_SPI8_LPTIM4_CH1_TRG             (uint32_t)(0x8U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM5_CH1_TRG    */
#define LL_SPI8_LPTIM5_CH1_TRG             (uint32_t)(0x9U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is RTC_ALRA_TRG      */
#define LL_SPI8_RTC_ALRA_TRG               (uint32_t)(0xAU << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is RTC_WUT_TRG       */
#define LL_SPI8_RTC_WUT_TRG                (uint32_t)(0xBU << SPI_AUTOCR_TRIGSEL_Pos)
#else
/* @brief  SPI1 to SPI6 Triggers */

/*!< HW Trigger signal is EXTI4_TRG         */
#define LL_SPI1_6_EXTI4_TRG                  (uint32_t)(0x4U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is EXTI5_TRG         */
#define LL_SPI1_6_EXTI5_TRG                  (uint32_t)(0x5U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM3_CH1_TRG    */
#define LL_SPI1_6_LPTIM3_CH1_TRG             (uint32_t)(0x7U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM4_CH1_TRG    */
#define LL_SPI1_6_LPTIM4_CH1_TRG             (uint32_t)(0x8U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM5_CH1_TRG    */
#define LL_SPI1_6_LPTIM5_CH1_TRG             (uint32_t)(0x9U << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is RTC_ALRA_TRG      */
#define LL_SPI1_6_RTC_ALRA_TRG               (uint32_t)(0xAU << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is RTC_WUT_TRG       */
#define LL_SPI1_6_RTC_WUT_TRG                (uint32_t)(0xBU << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is EXTI6_TRG         */
#define LL_SPI1_6_EXTI6_TRG                  (uint32_t)(0xCU << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is EXTI7_TRG         */
#define LL_SPI1_6_EXTI7_TRG                  (uint32_t)(0xDU << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM1_CH1_TRG    */
#define LL_SPI1_6_LPTIM1_CH1_TRG             (uint32_t)(0xEU << SPI_AUTOCR_TRIGSEL_Pos)
/*!< HW Trigger signal is LPTIM1_CH1_TRG    */
#define LL_SPI1_6_LPTIM2_CH1_TRG             (uint32_t)(0xFU << SPI_AUTOCR_TRIGSEL_Pos)

#endif /* SPI8 */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_AUTOCR_TRIGPOL  Autonomous Trigger Polarity
  * @brief    SPI Autonomous Trigger Polarity
  * @{
  */
#define LL_SPI_TRIG_POLARITY_RISING         0x00000000U           /*!< SPI triggered on rising edge  */
#define LL_SPI_TRIG_POLARITY_FALLING        SPI_AUTOCR_TRIGPOL    /*!< SPI triggered on falling edge */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup SPI_LL_Exported_Macros SPI Exported Macros
  * @{
  */

/** @defgroup SPI_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in SPI register
  * @param  __INSTANCE__ SPI Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_SPI_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in SPI register
  * @param  __INSTANCE__ SPI Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_SPI_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/

